load-test/results/docker/k6-fault.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6-script.js
        output: json (/home/orlando/Documents/K8s-TCCMBA/load-test/results/docker/fault-load-test.json)

     scenarios: (100.00%) 1 scenario, 30 max VUs, 2m30s max duration (incl. graceful stop):
              * default: 30 looping VUs for 2m0s (gracefulStop: 30s)


running (0m01.0s), 30/30 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 30 VUs  0m01.0s/2m0s

running (0m02.0s), 30/30 VUs, 30 complete and 0 interrupted iterations
default   [   2% ] 30 VUs  0m02.0s/2m0s

running (0m03.0s), 30/30 VUs, 60 complete and 0 interrupted iterations
default   [   2% ] 30 VUs  0m03.0s/2m0s

running (0m04.0s), 30/30 VUs, 90 complete and 0 interrupted iterations
default   [   3% ] 30 VUs  0m04.0s/2m0s

running (0m05.0s), 30/30 VUs, 120 complete and 0 interrupted iterations
default   [   4% ] 30 VUs  0m05.0s/2m0s

running (0m06.0s), 30/30 VUs, 150 complete and 0 interrupted iterations
default   [   5% ] 30 VUs  0m06.0s/2m0s

running (0m07.0s), 30/30 VUs, 180 complete and 0 interrupted iterations
default   [   6% ] 30 VUs  0m07.0s/2m0s

running (0m08.0s), 30/30 VUs, 210 complete and 0 interrupted iterations
default   [   7% ] 30 VUs  0m08.0s/2m0s

running (0m09.0s), 30/30 VUs, 240 complete and 0 interrupted iterations
default   [   7% ] 30 VUs  0m09.0s/2m0s

running (0m10.0s), 30/30 VUs, 270 complete and 0 interrupted iterations
default   [   8% ] 30 VUs  0m10.0s/2m0s

running (0m11.0s), 30/30 VUs, 300 complete and 0 interrupted iterations
default   [   9% ] 30 VUs  0m11.0s/2m0s

running (0m12.0s), 30/30 VUs, 330 complete and 0 interrupted iterations
default   [  10% ] 30 VUs  0m12.0s/2m0s

running (0m13.0s), 30/30 VUs, 360 complete and 0 interrupted iterations
default   [  11% ] 30 VUs  0m13.0s/2m0s

running (0m14.0s), 30/30 VUs, 390 complete and 0 interrupted iterations
default   [  12% ] 30 VUs  0m14.0s/2m0s

running (0m15.0s), 30/30 VUs, 420 complete and 0 interrupted iterations
default   [  12% ] 30 VUs  0m15.0s/2m0s

running (0m16.0s), 30/30 VUs, 450 complete and 0 interrupted iterations
default   [  13% ] 30 VUs  0m16.0s/2m0s

running (0m17.0s), 30/30 VUs, 480 complete and 0 interrupted iterations
default   [  14% ] 30 VUs  0m17.0s/2m0s

running (0m18.0s), 30/30 VUs, 510 complete and 0 interrupted iterations
default   [  15% ] 30 VUs  0m18.0s/2m0s

running (0m19.0s), 30/30 VUs, 540 complete and 0 interrupted iterations
default   [  16% ] 30 VUs  0m19.0s/2m0s

running (0m20.0s), 30/30 VUs, 570 complete and 0 interrupted iterations
default   [  17% ] 30 VUs  0m20.0s/2m0s
time="2026-06-15T23:21:24-03:00" level=warning msg="Request Failed" error="Get \"http://localhost:8080/clients\": EOF"
time="2026-06-15T23:21:24-03:00" level=warning msg="Request Failed" error="Get \"http://localhost:8080/clients\": EOF"
time="2026-06-15T23:21:24-03:00" level=warning msg="Request Failed" error="Get \"http://localhost:8080/clients\": EOF"
[...]
time="2026-06-15T23:21:24-03:00" level=warning msg="Request Failed" error="Get \"http://localhost:8080/clients\": read tcp 127.0.0.1:46790->127.0.0.1:8080: read: connection reset by peer"
time="2026-06-15T23:21:24-03:00" level=warning msg="Request Failed" error="Get \"http://localhost:8080/clients\": EOF"
time="2026-06-15T23:21:24-03:00" level=warning msg="Request Failed" error="Get \"http://localhost:8080/clients\": EOF"
time="2026-06-15T23:21:24-03:00" level=warning msg="Request Failed" error="Get \"http://localhost:8080/clients\": read tcp 127.0.0.1:46802->127.0.0.1:8080: read: connection reset by peer"
time="2026-06-15T23:21:24-03:00" level=warning msg="Request Failed" error="Get \"http://localhost:8080/clients\": EOF"

running (0m21.0s), 30/30 VUs, 600 complete and 0 interrupted iterations
default   [  17% ] 30 VUs  0m21.0s/2m0s
time="2026-06-15T23:21:25-03:00" level=warning msg="Request Failed" error="Get \"http://localhost:8080/clients\": dial tcp 127.0.0.1:8080: connect: connection refused"
time="2026-06-15T23:21:25-03:00" level=warning msg="Request Failed" error="Get \"http://localhost:8080/clients\": dial tcp 127.0.0.1:8080: connect: connection refused"
time="2026-06-15T23:21:25-03:00" level=warning msg="Request Failed" error="Get \"http://localhost:8080/clients\": dial tcp 127.0.0.1:8080: connect: connection refused"
[...]

running (0m22.0s), 30/30 VUs, 630 complete and 0 interrupted iterations
default   [  18% ] 30 VUs  0m22.0s/2m0s
time="2026-06-15T23:21:26-03:00" level=warning msg="Request Failed" error="Get \"http://localhost:8080/clients\": dial tcp 127.0.0.1:8080: connect: connection refused"
time="2026-06-15T23:21:26-03:00" level=warning msg="Request Failed" error="Get \"http://localhost:8080/clients\": dial tcp 127.0.0.1:8080: connect: connection refused"
time="2026-06-15T23:21:26-03:00" level=warning msg="Request Failed" error="Get \"http://localhost:8080/clients\": dial tcp 127.0.0.1:8080: connect: connection refused"
[...]

running (0m23.0s), 30/30 VUs, 660 complete and 0 interrupted iterations
default   [  19% ] 30 VUs  0m23.0s/2m0s

running (0m24.0s), 30/30 VUs, 690 complete and 0 interrupted iterations
default   [  20% ] 30 VUs  0m24.0s/2m0s

running (0m25.0s), 30/30 VUs, 720 complete and 0 interrupted iterations
default   [  21% ] 30 VUs  0m25.0s/2m0s

running (0m26.0s), 30/30 VUs, 750 complete and 0 interrupted iterations
default   [  22% ] 30 VUs  0m26.0s/2m0s

running (0m27.0s), 30/30 VUs, 780 complete and 0 interrupted iterations
default   [  22% ] 30 VUs  0m27.0s/2m0s

running (0m28.0s), 30/30 VUs, 810 complete and 0 interrupted iterations
default   [  23% ] 30 VUs  0m28.0s/2m0s

running (0m29.0s), 30/30 VUs, 840 complete and 0 interrupted iterations
default   [  24% ] 30 VUs  0m29.0s/2m0s

running (0m30.0s), 30/30 VUs, 870 complete and 0 interrupted iterations
default   [  25% ] 30 VUs  0m30.0s/2m0s

running (0m31.0s), 30/30 VUs, 900 complete and 0 interrupted iterations
default   [  26% ] 30 VUs  0m31.0s/2m0s

running (0m32.0s), 30/30 VUs, 930 complete and 0 interrupted iterations
default   [  27% ] 30 VUs  0m32.0s/2m0s

running (0m33.0s), 30/30 VUs, 960 complete and 0 interrupted iterations
default   [  27% ] 30 VUs  0m33.0s/2m0s

running (0m34.0s), 30/30 VUs, 990 complete and 0 interrupted iterations
default   [  28% ] 30 VUs  0m34.0s/2m0s

running (0m35.0s), 30/30 VUs, 1020 complete and 0 interrupted iterations
default   [  29% ] 30 VUs  0m35.0s/2m0s

running (0m36.0s), 30/30 VUs, 1050 complete and 0 interrupted iterations
default   [  30% ] 30 VUs  0m36.0s/2m0s

running (0m37.0s), 30/30 VUs, 1080 complete and 0 interrupted iterations
default   [  31% ] 30 VUs  0m37.0s/2m0s

running (0m38.0s), 30/30 VUs, 1110 complete and 0 interrupted iterations
default   [  32% ] 30 VUs  0m38.0s/2m0s

running (0m39.0s), 30/30 VUs, 1140 complete and 0 interrupted iterations
default   [  32% ] 30 VUs  0m39.0s/2m0s

running (0m40.0s), 30/30 VUs, 1170 complete and 0 interrupted iterations
default   [  33% ] 30 VUs  0m40.0s/2m0s

running (0m41.0s), 30/30 VUs, 1200 complete and 0 interrupted iterations
default   [  34% ] 30 VUs  0m41.0s/2m0s

running (0m42.0s), 30/30 VUs, 1230 complete and 0 interrupted iterations
default   [  35% ] 30 VUs  0m42.0s/2m0s

running (0m43.0s), 30/30 VUs, 1260 complete and 0 interrupted iterations
default   [  36% ] 30 VUs  0m43.0s/2m0s

running (0m44.0s), 30/30 VUs, 1290 complete and 0 interrupted iterations
default   [  37% ] 30 VUs  0m44.0s/2m0s

running (0m45.0s), 30/30 VUs, 1320 complete and 0 interrupted iterations
default   [  37% ] 30 VUs  0m45.0s/2m0s

running (0m46.0s), 30/30 VUs, 1350 complete and 0 interrupted iterations
default   [  38% ] 30 VUs  0m46.0s/2m0s

running (0m47.0s), 30/30 VUs, 1380 complete and 0 interrupted iterations
default   [  39% ] 30 VUs  0m47.0s/2m0s

running (0m48.0s), 30/30 VUs, 1410 complete and 0 interrupted iterations
default   [  40% ] 30 VUs  0m48.0s/2m0s

running (0m49.0s), 30/30 VUs, 1440 complete and 0 interrupted iterations
default   [  41% ] 30 VUs  0m49.0s/2m0s

running (0m50.0s), 30/30 VUs, 1470 complete and 0 interrupted iterations
default   [  42% ] 30 VUs  0m50.0s/2m0s

running (0m51.0s), 30/30 VUs, 1500 complete and 0 interrupted iterations
default   [  42% ] 30 VUs  0m51.0s/2m0s

running (0m52.0s), 30/30 VUs, 1530 complete and 0 interrupted iterations
default   [  43% ] 30 VUs  0m52.0s/2m0s

running (0m53.0s), 30/30 VUs, 1560 complete and 0 interrupted iterations
default   [  44% ] 30 VUs  0m53.0s/2m0s

running (0m54.0s), 30/30 VUs, 1590 complete and 0 interrupted iterations
default   [  45% ] 30 VUs  0m54.0s/2m0s

running (0m55.0s), 30/30 VUs, 1620 complete and 0 interrupted iterations
default   [  46% ] 30 VUs  0m55.0s/2m0s

running (0m56.0s), 30/30 VUs, 1650 complete and 0 interrupted iterations
default   [  47% ] 30 VUs  0m56.0s/2m0s

running (0m57.0s), 30/30 VUs, 1680 complete and 0 interrupted iterations
default   [  47% ] 30 VUs  0m57.0s/2m0s

running (0m58.0s), 30/30 VUs, 1710 complete and 0 interrupted iterations
default   [  48% ] 30 VUs  0m58.0s/2m0s

running (0m59.0s), 30/30 VUs, 1740 complete and 0 interrupted iterations
default   [  49% ] 30 VUs  0m59.0s/2m0s

running (1m00.0s), 30/30 VUs, 1770 complete and 0 interrupted iterations
default   [  50% ] 30 VUs  1m00.0s/2m0s

running (1m01.0s), 30/30 VUs, 1800 complete and 0 interrupted iterations
default   [  51% ] 30 VUs  1m01.0s/2m0s

running (1m02.0s), 30/30 VUs, 1830 complete and 0 interrupted iterations
default   [  52% ] 30 VUs  1m02.0s/2m0s

running (1m03.0s), 30/30 VUs, 1860 complete and 0 interrupted iterations
default   [  52% ] 30 VUs  1m03.0s/2m0s

running (1m04.0s), 30/30 VUs, 1890 complete and 0 interrupted iterations
default   [  53% ] 30 VUs  1m04.0s/2m0s

running (1m05.0s), 30/30 VUs, 1920 complete and 0 interrupted iterations
default   [  54% ] 30 VUs  1m05.0s/2m0s

running (1m06.0s), 30/30 VUs, 1950 complete and 0 interrupted iterations
default   [  55% ] 30 VUs  1m06.0s/2m0s

running (1m07.0s), 30/30 VUs, 1980 complete and 0 interrupted iterations
default   [  56% ] 30 VUs  1m07.0s/2m0s

running (1m08.0s), 30/30 VUs, 2010 complete and 0 interrupted iterations
default   [  57% ] 30 VUs  1m08.0s/2m0s

running (1m09.0s), 30/30 VUs, 2040 complete and 0 interrupted iterations
default   [  57% ] 30 VUs  1m09.0s/2m0s

running (1m10.0s), 30/30 VUs, 2070 complete and 0 interrupted iterations
default   [  58% ] 30 VUs  1m10.0s/2m0s

running (1m11.0s), 30/30 VUs, 2100 complete and 0 interrupted iterations
default   [  59% ] 30 VUs  1m11.0s/2m0s

running (1m12.0s), 30/30 VUs, 2130 complete and 0 interrupted iterations
default   [  60% ] 30 VUs  1m12.0s/2m0s

running (1m13.0s), 30/30 VUs, 2160 complete and 0 interrupted iterations
default   [  61% ] 30 VUs  1m13.0s/2m0s

running (1m14.0s), 30/30 VUs, 2190 complete and 0 interrupted iterations
default   [  62% ] 30 VUs  1m14.0s/2m0s

running (1m15.0s), 30/30 VUs, 2220 complete and 0 interrupted iterations
default   [  62% ] 30 VUs  1m15.0s/2m0s

running (1m16.0s), 30/30 VUs, 2250 complete and 0 interrupted iterations
default   [  63% ] 30 VUs  1m16.0s/2m0s

running (1m17.0s), 30/30 VUs, 2280 complete and 0 interrupted iterations
default   [  64% ] 30 VUs  1m17.0s/2m0s

running (1m18.0s), 30/30 VUs, 2310 complete and 0 interrupted iterations
default   [  65% ] 30 VUs  1m18.0s/2m0s

running (1m19.0s), 30/30 VUs, 2340 complete and 0 interrupted iterations
default   [  66% ] 30 VUs  1m19.0s/2m0s

running (1m20.0s), 30/30 VUs, 2370 complete and 0 interrupted iterations
default   [  67% ] 30 VUs  1m20.0s/2m0s

running (1m21.0s), 30/30 VUs, 2400 complete and 0 interrupted iterations
default   [  67% ] 30 VUs  1m21.0s/2m0s

running (1m22.0s), 30/30 VUs, 2430 complete and 0 interrupted iterations
default   [  68% ] 30 VUs  1m22.0s/2m0s

running (1m23.0s), 30/30 VUs, 2460 complete and 0 interrupted iterations
default   [  69% ] 30 VUs  1m23.0s/2m0s

running (1m24.0s), 30/30 VUs, 2490 complete and 0 interrupted iterations
default   [  70% ] 30 VUs  1m24.0s/2m0s

running (1m25.0s), 30/30 VUs, 2520 complete and 0 interrupted iterations
default   [  71% ] 30 VUs  1m25.0s/2m0s

running (1m26.0s), 30/30 VUs, 2550 complete and 0 interrupted iterations
default   [  72% ] 30 VUs  1m26.0s/2m0s

running (1m27.0s), 30/30 VUs, 2580 complete and 0 interrupted iterations
default   [  72% ] 30 VUs  1m27.0s/2m0s

running (1m28.0s), 30/30 VUs, 2610 complete and 0 interrupted iterations
default   [  73% ] 30 VUs  1m28.0s/2m0s

running (1m29.0s), 30/30 VUs, 2640 complete and 0 interrupted iterations
default   [  74% ] 30 VUs  1m29.0s/2m0s

running (1m30.0s), 30/30 VUs, 2670 complete and 0 interrupted iterations
default   [  75% ] 30 VUs  1m30.0s/2m0s

running (1m31.0s), 30/30 VUs, 2700 complete and 0 interrupted iterations
default   [  76% ] 30 VUs  1m31.0s/2m0s

running (1m32.0s), 30/30 VUs, 2730 complete and 0 interrupted iterations
default   [  77% ] 30 VUs  1m32.0s/2m0s

running (1m33.0s), 30/30 VUs, 2760 complete and 0 interrupted iterations
default   [  77% ] 30 VUs  1m33.0s/2m0s

running (1m34.0s), 30/30 VUs, 2790 complete and 0 interrupted iterations
default   [  78% ] 30 VUs  1m34.0s/2m0s

running (1m35.0s), 30/30 VUs, 2820 complete and 0 interrupted iterations
default   [  79% ] 30 VUs  1m35.0s/2m0s

running (1m36.0s), 30/30 VUs, 2850 complete and 0 interrupted iterations
default   [  80% ] 30 VUs  1m36.0s/2m0s

running (1m37.0s), 30/30 VUs, 2880 complete and 0 interrupted iterations
default   [  81% ] 30 VUs  1m37.0s/2m0s

running (1m38.0s), 30/30 VUs, 2910 complete and 0 interrupted iterations
default   [  82% ] 30 VUs  1m38.0s/2m0s

running (1m39.0s), 30/30 VUs, 2940 complete and 0 interrupted iterations
default   [  82% ] 30 VUs  1m39.0s/2m0s

running (1m40.0s), 30/30 VUs, 2970 complete and 0 interrupted iterations
default   [  83% ] 30 VUs  1m40.0s/2m0s

running (1m41.0s), 30/30 VUs, 3000 complete and 0 interrupted iterations
default   [  84% ] 30 VUs  1m41.0s/2m0s

running (1m42.0s), 30/30 VUs, 3030 complete and 0 interrupted iterations
default   [  85% ] 30 VUs  1m42.0s/2m0s

running (1m43.0s), 30/30 VUs, 3060 complete and 0 interrupted iterations
default   [  86% ] 30 VUs  1m43.0s/2m0s

running (1m44.0s), 30/30 VUs, 3090 complete and 0 interrupted iterations
default   [  87% ] 30 VUs  1m44.0s/2m0s

running (1m45.0s), 30/30 VUs, 3120 complete and 0 interrupted iterations
default   [  87% ] 30 VUs  1m45.0s/2m0s

running (1m46.0s), 30/30 VUs, 3150 complete and 0 interrupted iterations
default   [  88% ] 30 VUs  1m46.0s/2m0s

running (1m47.0s), 30/30 VUs, 3180 complete and 0 interrupted iterations
default   [  89% ] 30 VUs  1m47.0s/2m0s

running (1m48.0s), 30/30 VUs, 3210 complete and 0 interrupted iterations
default   [  90% ] 30 VUs  1m48.0s/2m0s

running (1m49.0s), 30/30 VUs, 3240 complete and 0 interrupted iterations
default   [  91% ] 30 VUs  1m49.0s/2m0s

running (1m50.0s), 30/30 VUs, 3270 complete and 0 interrupted iterations
default   [  92% ] 30 VUs  1m50.0s/2m0s

running (1m51.0s), 30/30 VUs, 3300 complete and 0 interrupted iterations
default   [  92% ] 30 VUs  1m51.0s/2m0s

running (1m52.0s), 30/30 VUs, 3330 complete and 0 interrupted iterations
default   [  93% ] 30 VUs  1m52.0s/2m0s

running (1m53.0s), 30/30 VUs, 3360 complete and 0 interrupted iterations
default   [  94% ] 30 VUs  1m53.0s/2m0s

running (1m54.0s), 30/30 VUs, 3390 complete and 0 interrupted iterations
default   [  95% ] 30 VUs  1m54.0s/2m0s

running (1m55.0s), 30/30 VUs, 3420 complete and 0 interrupted iterations
default   [  96% ] 30 VUs  1m55.0s/2m0s

running (1m56.0s), 30/30 VUs, 3450 complete and 0 interrupted iterations
default   [  97% ] 30 VUs  1m56.0s/2m0s

running (1m57.0s), 30/30 VUs, 3480 complete and 0 interrupted iterations
default   [  97% ] 30 VUs  1m57.0s/2m0s

running (1m58.0s), 30/30 VUs, 3510 complete and 0 interrupted iterations
default   [  98% ] 30 VUs  1m58.0s/2m0s

running (1m59.0s), 30/30 VUs, 3540 complete and 0 interrupted iterations
default   [  99% ] 30 VUs  1m59.0s/2m0s

running (2m00.0s), 30/30 VUs, 3570 complete and 0 interrupted iterations
default   [ 100% ] 30 VUs  2m00.0s/2m0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<1000' p(95)=6.08ms

    http_req_failed
    ✗ 'rate<0.01' rate=2.11%


  █ TOTAL RESULTS 

    checks_total.......: 3600   29.858927/s
    checks_succeeded...: 97.88% 3524 out of 3600
    checks_failed......: 2.11%  76 out of 3600

    ✗ status is 200
      ↳  97% — ✓ 3524 / ✗ 76

    HTTP
    http_req_duration..............: avg=3.81ms min=0s     med=3.44ms max=26.06ms p(90)=5.01ms p(95)=6.08ms
      { expected_response:true }...: avg=3.81ms min=1.68ms med=3.45ms max=20.55ms p(90)=4.98ms p(95)=5.96ms
    http_req_failed................: 2.11%  76 out of 3600
    http_reqs......................: 3600   29.858927/s

    EXECUTION
    iteration_duration.............: avg=1s     min=1s     med=1s     max=1.02s   p(90)=1s     p(95)=1s    
    iterations.....................: 3600   29.858927/s
    vus............................: 30     min=30         max=30
    vus_max........................: 30     min=30         max=30

    NETWORK
    data_received..................: 34 MB  282 kB/s
    data_sent......................: 274 kB 2.3 kB/s



running (2m00.6s), 00/30 VUs, 3600 complete and 0 interrupted iterations
default ✓ [ 100% ] 30 VUs  2m0s
time="2026-06-15T23:23:05-03:00" level=error msg="thresholds on metrics 'http_req_failed' have been crossed"